export default {
  title: 'Благодаря вашей поддержке уже много лет мы не перестаем верить в чудеса. Ведь они случаются каждый день!',
  requisites: '<strong>Полное наименование: Благотворительный фонд "ИНСАН"</strong><br>\n' +
    '<strong>ОГРН</strong>: 1120500000576<br>\n' +
    '<strong>ИНН:</strong> 0572001481 / КПП: 057201001&nbsp;<br>\n' +
    'Банковские реквизиты:&nbsp;<br>\n' +
    '<strong>к/с:</strong> 3010 1810 9070 2000 0615&nbsp;<br>\n' +
    '<strong>р/с:</strong> 4070 3810 8603 2000 0110&nbsp;<br>\n' +
    'Наименование банка: СТАВРОПОЛЬСКОЕ ОТДЕЛЕНИЕ N5230 ПАО СБЕРБАНК&nbsp;<br>\n' +
    '<strong>БИК:</strong> 040702615',
  contacts: '<strong>Наш адрес:</strong><br>\n' +
    'Офис в Москве: Московский проспект, 2</p>\n' +
    '\n' +
    '<p>Офис в Махачкале:&nbsp;ул. Дахадаева, 136</p>\n' +
    '\n' +
    '<p><br>\n' +
    '<strong>Контакты</strong><br>\n' +
    'Тел.: 8 (800) 600 09 91<br>\n' +
    'Email: insan05ru@mail.ru</p>\n' +
    '</main>'
}