import { SectionTargetData } from '~/components/sections/about-page/SectionTarget.vue';

export const targetData = {
  title: 'Наша цель',
  description: '<p> Знакомя людей с историями подопечных, нам удается привлечь общественное внимание' +
    'к проблемам малоимущих граждан. </p>' +
    '<p>Следуя этому вектору работы, фонд развивает культуру закята через разъяснение его ценности и важности. ' +
    'Оказываемая через Фонд «Инсан» помощь имеет целенаправленный, аргументированный, адресный характер.</p>' +
    '<p>Фондом проводится тщательная проверка всех обращений: анкетирование и выездная инспекционная поездка. Это делается для полной прозрачности нашей работы, для установления действительного положения дел у подопечных, для проведения более полного набора вспомогательных мер \n' +
    'и мероприятий.</p>',
  image: {
    alt: 'image',
    src: 'https://picsum.photos/630/640',
    width: 630,
    height: 640,
  }
} as unknown as SectionTargetData