<script setup lang="ts">
const props = defineProps(['currentTab']);
</script>

<template>
  <div class="tabs-wrapper">
    <div v-if="currentTab === 'whatIsZakat'" class="tab tab-what-is-zakat">
      <p>
        Фонд «Инсан» является лидером по сбору и распределению закята в России и в странах СНГ.
      </p>
      <p>
        Что такое закят? Закят (обязательная ежегодная выплата в пользу бедных) — это в первую очередь поклонение
        Всевышнему.
      </p>
      <p>
        Слово «закят» означает — «очищение», «благодать», «рост», «увеличение» и «чистота».
      </p>
      <p>
        Закят связан с правами бедных и слабых на часть имущества богатых и состоятельных людей. Это выражение
        милосердия, помощи и сочувствия, на которые нам указал Пророк Мухаммад (мир ему и благословение) в известном
        хадисе: «Верующие, проявляющие дружеские чувства, милосердие и сочувствие друг к другу, похожи на одно тело.
        Если одна его часть болит, то болит все тело» (Бухари).
      </p>
      <p>
        Закят — важный социально-экономический институт, призванный утвердить в обществе принципы справедливости. Он
        сплачивает мусульман, призывает заботиться друг о друге, дает толчок к духовному развитию и оздоровлению
        общества. Закят с имущества выплачивается
        не чаще одного раза в год. Закят совершается по правилам, установленным Самим Всевышним.
      </p>
      <p>
        Закят в Фонде «Инсан» БФ «Инсан» помогает рассчитать закят и принимает его от мусульман для дальнейшего
        распределения среди определенных категорий людей, указанных в Коране,
        в соответствии с требованием шариата.
      </p>
      <p>
        Цель программы «Закят»
      </p>
      <p>
        Основная цель программы — донести материальную помощь до тех, кто в ней очень нуждается. Не всегда выплачивающие
        закят знают о получателях, и тут фонд выступает посредником между плательщиками и получающими закят,
        централизует и распределяет его среди незащищенных слоев населения, к которым относятся: нищие, бедные,
        новообращенные, несостоятельные должники и путники. Под названные категории могут подпадать и многодетные семьи,
        дети-сироты, одинокие старики и больные. «А тех, которые собирают золото и серебро и не расходуют его на пути
        Аллаха, обрадуй мучительным наказанием. В тот День [их золото и серебро] будет разожжено в огне геенны, и им
        будут заклеймены их лбы, и бока, и спины. Это то, что вы сберегали для самих себя. Вкусите же то, что вы
        сберегали» (сура «Покаяние», аят 34).
      </p>
      <p>
        «Если человек, владеющий богатством, не выплачивает закят, то он будет гореть в пламени геенны и для него будут
        уготовлены пластины, которыми будут прижигать его бока и лоб.
        И продлится это, пока Аллах будет вершить суд над своими рабами в День, который равен пятидесяти тысячам лет, а
        затем Аллах определит его место либо в Раю, либо в Аду» (сура «Покаяние», аят 35).
      </p>
      <p>
        Садака можно пожертвовать в любое время и в любом количестве. Садака — это сунна. Закят же, напротив, — один из
        столпов Ислама, священная обязанность состоятельных мусульман. Пророк Мухаммад (мир ему и благословение)
        говорил: «Поистине, богатство привлекательно
        и приятно на вкус, и прекрасно поступит обладающий богатством мусульманин, если станет тратить часть его на
        неимущих, сирот и путников» (Бухари).
      </p>
      <p>
        «Тому, чтобы были приняты их пожертвования, препятствует то, что они не веруют в Аллаха и Его Посланника» (сура
        «Покаяние», аят 54).
      </p>
    </div>
    <div v-if="currentTab === 'payableFrom'" class="tab tab--payable-from">
      <div class="tab__item">
        <span>Имущество,с которого выплачивается закят</span>
        <p>
          Одно из условий для выплаты закята - это увеличение имущества, подпадающего под обложение закятом. Важно,
          чтобы
          имущество находилось в обороте, и в процессе достигло уровня нисаба. Владение нисабом – это единый критерий
          для
          любого из облагаемых закятом видов имущества. С имущества мусульманина в количестве, не достигающем нисаба,
          закят не выплачивается. Мудрость этого условия в том, что выплата закята с «мертвого» капитала, то есть того,
          которое не увеличивается, разорило бы его владельца.
        </p>
        <p>
          Имущество, с которого должны выплачивать закят:
        </p>
      </div>

      <div class="tab__item">
        <span>1. Золото и серебро</span>
        <p>
          Закят выплачивается с золота или серебра, будь это отчеканенные монеты или слитки. Это могут быть и ценные
          бумаги, заменяющие их и гарантирующие по ним выплату золотом и серебром.
        </p>
      </div>

      <div class="tab__item">
        <span>Разновидности золота и серебра, с которых выплачивается закят.</span>
        <ol>
          <li>
            Серебряные дирхамы и золотые динары, и любое другое, что отчеканено для сделки.
          </li>
          <li>
            Слитки из золота и серебра.
          </li>
          <li>
            Посуды и куски из серебра и золота, изготовленные для использования и украшения.
          </li>
        </ol>
      </div>

      <div class="tab__item">
        <p>
          С золотых украшений, которые носят и используют, не выходя за рамки культуры местности проживания, закят не
          выплачивается. Также не выплачивается занят с серебряных колец, которые носят мужчины.
        </p>
        <p>
          Джабир передаёт от Посланника Аллаха, да благословит его Аллах и приветствует, что он сказал: «Нет закята с
          украшений». Имам аш-Шафии в книге «Аль-Умм» передаёт, что некий спросил у Джабира бин Абдуллы об украшениях,
          нужно ли выплачивать закят с них, на что он ответил: «Нет».
        </p>
        <p>
          В отличии от вышеперечисленного, запрещенные для мужчин украшения из золота или серебра (кроме серебряного
          кольца), будь то запонки, часы, или кухонные принадлежности (посуда, сувениры) подлежат обложению закятом.
        </p>
        <p>
          Облагаемый закятом минимум равен 85 граммам золота, или 595 граммов серебра. С такого количества ценностей,
          будь то золото или серебро, или ценные бумаги заменяющие их и гарантирующие выплату по ним, мусульманин должен
          выплатить 2.5% от суммы нисаба.
        </p>
      </div>

      <div class="tab__item">
        <span>2. Скот:</span>
        <p>
          верблюды, коровы, овцы и козы. Доказательством этого является известное письмо Абу Бакра, текст которого
          приводит Аль-Бухари. В нём говорится о том, что Пророк (мир ему и благословение Аллаха) обязал мусульман
          выплачивать закят с перечисленных выше видов животных.
        </p>
      </div>

      <div class="tab__item">
        <span>3. Продукты земледелия: плоды и зерновые.</span>
        <p>
          Всевышний Аллах сказал: «Вкушайте эти плоды, когда они созревают, и отдавайте должное в день уборки» (сура
          «Скот», аят 141, перевод смысла). От Ибн Аббаса передаётся, что в этом аяте имеется в виду выплата закята.
        </p>
        <p>
          Закят выплачивается c продуктов земледелия, которые могут выступать основными продуктами питания. От Абу Мусы
          аль-Аш’ари и Муаза передаётся, что Пророк (мир ему и благословение Аллаха) сказал им: «Собирайте закят только
          с четырёх видов зерновых и плодов: “ячменя, пшеницы, изюма и фиников”» (передал Аль-Хаким с достоверным
          иснадом).
        </p>
      </div>

      <div class="tab__item">
        <span>4. Предметы торговли.</span>
        <p>
          В этот пункт входит всё, чем торгует мусульманин, независимо от того, облагаются предметы товара закятом сами
          по себе (как перечисленные выше) или нет. Всевышний Аллах сказал: «О те, которые уверовали! Делайте
          пожертвования из приобретённых вами благ» (сура «Корова», аят 267, перевод смысла). От Муджахида передаётся,
          что этот аят был ниспослан по поводу торговли.
          Закят - это механизм, который продуман до мелочей. И чтобы разобраться в каждой, Фонд «Инсан» проводит
          консультирование по вопросам обложения закятом. Вы можете обратиться лично или по номеру
          <strong>88006000991</strong>
        </p>
      </div>
    </div>
    <div v-if="currentTab === 'recipients'" class="tab tab--recipients">
      <div class="tab__item">
        <span>Кто получает закят?</span>
        <p>
          Всевышний Аллах в Коране ясно очертил мусульманам круг людей которые достойны получать закят, и ограничил их
          количество восьмью категориями, никто кроме этих людей не получает закят, даже если являются сиротами,
          инвалидами или больными. Так же стоит отметить, и подчеркнуть, что получающие закят должны быть мусульманами,
          и не должны постоянствовать в больших грехах.
        </p>
      </div>

      <div class="tab__item">
        <span>Факир.</span>
        <p>
          Это человек, который испытывает сильную нужду в деньгах, в еде, в одежде, в жилье. Например, мискином является
          мусульманин, которому месячный минимум нужен 10 000 рублей, но он получает только 3000. То есть человек,
          который из необходимых 100 % может позволить себе 30%.
        </p>
      </div>

      <div class="tab__item">
        <span>Мискин</span>
        <p>
          Это человек, которому из необходимого минимума 100 % получает только 70-80 %.
        </p>
      </div>

      <div class="tab__item">
        <span>Сборщики и раздатчики закята.</span>
        <p>
          Те, кто занимается сбором и раздачей закята, - это люди, которых имам или его заместители назначили выполнять
          какую-либо работу, связанную с закятом, например, сбор, учёт, хранение или распределение закята. К ним
          относятся сборщики, кладовщики, бухгалтера, охранники, инкассаторы, разносчики и другие лица. Работающий в
          сфере закята должен быть совершеннолетним здравомыслящим надёжным мусульманином, справляющимся со своей
          работой, за которую он получает соответствующую плату.
        </p>
      </div>

      <div class="tab__item">
        <span>Сборщики и раздатчики закята.</span>
        <p>
          Те, кто занимается сбором и раздачей закята, - это люди, которых имам или его заместители назначили выполнять
          какую-либо работу, связанную с закятом, например, сбор, учёт, хранение или распределение закята. К ним
          относятся сборщики, кладовщики, бухгалтера, охранники, инкассаторы, разносчики и другие лица. Работающий в
          сфере закята должен быть совершеннолетним здравомыслящим надёжным мусульманином, справляющимся со своей
          работой, за которую он получает соответствующую плату.
        </p>
      </div>


      <div class="tab__item">
        <span>Новообращенные мусульмане.</span>
        <p>
          Эти люди которые не так давно пришли в ислам, желательно им дать закят, чтоб усилить их веру и поддержать их
          материально. Так же мусульманам, которые могут способствовать предотвращению преследования других мусульман,
          помогают им и заступаются за мусульман перед неверными.
        </p>
      </div>


      <div class="tab__item">
        <span>Для освобождения рабов.</span>
        <p>
          Для таких людей выплачивается закят, чтоб они могли погашать свои долги, и это только в том случае, если они
          брали деньги в долг на дозволенное Шариатом. Если деньги брали на расходы на недозволенное Аллахом, то таким
          людям закят не выдается, только если они не покаялись . Таким людям можно выдавать закят, если их покаяние
          покажется истинной, а не для того чтоб получить закят.
        </p>
      </div>


      <div class="tab__item">
        <span>На пути Аллаха.</span>
        <p>
          Эта та категория людей, которые борются на пути Аллаха, защищая Его религию, отстаивая интересы и права
          мусульман.
        </p>
      </div>

    </div>
    <div v-if="currentTab === 'zakatUlitr'" class="tab tab--zakatUlitr">
      <div class="tab__item">
        <span>Закят уль-Фитр</span>
        <p>
          Закят-уль-фитр (или закат-са‘; закат-сах) обязан уплатить каждый мусульманин (мусульманка), имеющий пропитание
          на более чем одни сутки и живой ко времени захода солнца накануне ‘Ид-уль-Фитра (то есть накануне дня
          Ураза-байрам). Так, если до этого момента родится ребенок, то за него следует уплатить закят-уль-фитр, и если
          кто-либо умрет до этого момента, то за него закят-уль-фитр не снимают.
        </p>
        <p>
          Закят-уль-фитр можно уплатить в течение всего месяца Рамазан, но лучше – со времени захода солнца накануне
          ‘Ид-уль-Фитра. Отдать его лучше всего до начала праздничного намаза, но можно и в течение праздничного дня до
          захода солнца. Откладывать его выдачу после этого срока – харам (запрещено). А кто не успел выплатить
          Закат-уль-фитр к этому сроку, обязан возместить его как можно скорее.
        </p>
        <p>
          Каждый взрослый мусульманин обязан уплатить закят-сах не только за себя, но и за тех, кто законно находится на
          его иждивении (за жену, детей и т.д.) При этом желательно получить полномочие (вакиль) от тех, за кого
          уплачивается са‘.
        </p>
        <p>
          Са‘ снимается наиболее часто употребляемыми продуктами. В Дагестане (как и по всей России) наиболее часто
          употребляемым продуктом является пшеничный хлеб, поэтому са‘ следует снимать пшеницей. При этом пшеница должна
          быть хорошего качества и чистой. Са‘ пшеницы составляет 2 кг 400 г, но с учетом возможных примесей лучше
          отдать по 2 кг 500 г. Некоторые алимы считают, что са‘ — это 2 кг 700 г, если взять за основу это количество,
          будет еще лучше. По ханафитскому мазхабу са‘ составляет 3 кг
        </p>
        <p>
          Кроме того, в том случае, если выплатить са‘ пшеницей затруднительно, по ханафитскому мазхабу са‘ можно
          выплатить и деньгами – стоимость такого же количества пшеницы. При этом шафи‘итам, делая нийят, необходимо
          говорить, что са‘ выплачивается деньгами, следуя имаму Абу Ханифе. Но последователям шафи‘итского мазхаба
          лучше са' снять пшеницей.
        </p>
        <p>
          Перед снятием закят-са‘ следует сделать нийят: “Я намереваюсь снять за себя (за свою жену, несовершеннолетних
          детей: сына, дочь – произносится имя того, за кого снимаешь) обязательный(фарз) са‘— закят-уль-фитр во имя
          Всевышнего Аллаха”.
        </p>
        <p>
          Если за совершеннолетнего мусульманина са‘ снимает другой мусульманин, то следует его уполномочить на это,
          т.е. сделать его вакилем.
        </p>

        <div class="tab__item">
          <p>
            Закят-уль-фитр, как и закат вообще, следует отдать только строго определенным категориям людей:
          </p>
          <ol>
            <li>
              бедным (т.е. имеющим доход, составляющий 20-30% от необходимого);
            </li>
            <li>
              неимущим (т.е. имеющим доход в 70-80% от необходимого);
            </li>
            <li>
              работникам, связанным со сбором, хранением, учетом, распределением заката, в качестве заработной платы;
            </li>
            <li>
              новообращенным (т.е. тем, кто принял Ислам и нуждается в материальной или моральной поддержке);
            </li>
            <li>
              невольникам, освободившимся по договору о само выкупе;
            </li>
            <li>
              тем, кто имеет долги, взятые на цели, разрешенные Шариатом (лечение, питание, строительство необходимого
              жилья, покупка необходимой одежды и т.д.);
            </li>
            <li>
              тем, кто находится на истинном пути и ведет священную войну (газават) против неверных;
            </li>
            <li>
              путникам, находящимся в путешествии, дозволенном Шариатом, и оставшимся без необходимых средств.
            </li>
          </ol>
        </div>

        <p>
          Необходимо подчеркнуть, что закат положен только вышеперечисленным категориям мусульман, и его выдача другим
          (например, сиротам или инвалидам, если они не попадают в перечисленные категории, мечетям и т.д.) недопустима,
          ибо в этом случае фарз остается не исполненным и это считается просто милостыней (садака).
        </p>

        <p>
          В первую очередь закат следует отдать родственникам и соседям, которым положен закят (за исключением тех
          родственников, кого по Шариату обязан содержать выплачивающий сах; а содержать мусульманин обязан жену,
          несовершеннолетних детей, немощных родителей и т.д.). Если среди них нет людей, которым положен закат, тогда
          надо отдать тем, кому положено, из жителей данного населенного пункта. Если и в селе (городе) нет таких людей,
          то в соседние города, села.
        </p>

        <p>
          Тот, кому положен сах и кто получил его, вправе распоряжаться им как захочет: съесть, продать, подарить и т.д.
        </p>

        <p>
          Са' следует отдать не менее чем трем мусульманам. Поэтому лучше смешать несколько сахов, а потом разделить
          между получателями.
        </p>

        <p>
          Са' очищает мусульманина от небольших грехов, от погрешностей поста. В хадисе сказано, что пост, который
          мусульманин соблюдал в течение месяца Рамазан, не возносится на небо, а зависает между небом и землей, пока не
          будет уплачен закят-уль-фитр.
        </p>
      </div>
    </div>
    <div v-if="currentTab === 'alms'" class="tab tab--alms">
      <div class="tab__item">
        <span>Милостыня (садака)</span>
      </div>
      <div class="tab__item">
        <span>Достоинства и плоды милостыни</span>
      </div>
      <div class="tab__item">
        <p>
          Всевышний Аллах сказал:
        </p>
        <p>
          1. Милостыня – это причина увеличения имущества и обширности пропитания. Всевышний Аллах сказал: «Аллах
          уничтожает лихву и взращивает пожертвования» (Коран, 2:276). Пророк Мухаммад, да благословит его Аллах и
          приветствует, сказал:<br> «Милостыня ничего не убавляет от имущества»(Привёл Муслим).
        </p>
        <p>
          2. Милостыня – это причина исцеления болезней. Пророк Мухаммад, да благословит его Аллах и приветствует,
          сказал: <br> «Лечите своих больных с помощью милостыни».
        </p>
        <p>
          3. Милостыня – это доказательство правдивости веры. Пророк Мухаммад, да благословит его Аллах и приветствует,
          сказал: <br> «Милостыня – это доказательство» (Привёл Муслим).
        </p>
        <p>
          4. Милостыня – это причина для достижения благочестия и богобоязненности. Всевышний Аллах сказал: <br> «Вы не
          обретете благочестия, пока не будете расходовать из того, что вы любите, и что бы вы ни расходовали, Аллах
          ведает об этом» (Коран, 3:92).
        </p>
        <p>
          5. Милостыня очищает душу и возвышает её. Всевышний Аллах сказал: <br> «Бери из их имущества пожертвования, чтобы
          ими очистить и возвысить их. Молись за них, ибо твои молитвы – успокоение для них. Воистину, Аллах Слышащий,
          Знающий» (Коран, 9:103).
        </p>
        <p>
          6. Милостыня покрывает раздающего милостыню тенью от палящего солнца в Судный День. Пророк Мухаммад, да
          благословит его Аллах и приветствует, сказал: <br> «Каждый человек будет находиться в тени своей милостыни до тех
          пор, пока не будет произведён над людьми суд» (Привёл Ахмад). Также сообщается в хадисе о семерых, которые в
          Судный День окажутся в тени: «… и человек, раздававший милостыню, так, что левая рука не знала, что дала
          правая рука» (Привёл аль-Бухари, Муслим).
        </p>
        <p>
          7. Милостыня – это нрав Пророка Мухаммада, да благословит его Аллах и приветствует. Сообщается, что Ибн
          ‘Аббас, да будет доволен им Аллах, сказал: <br> «Посланник Аллаха, да благословит его Аллах и приветствует, был
          щедрейшим из людей, а наибольшую щедрость проявлял он в Рамадане, когда с ним встречался Джибрил, мир ему. Во
          время Рамадана он встречался с ним каждую ночь, повторяя с ним Коран, и, поистине, (в эти дни) посланник
          Аллаха, да благословит его Аллах и приветствует, был более щедр на всё благое, чем вольный ветер (ветер,
          посылаемый Аллахом на благо людям)» (Привёл аль-Бухари, 6; Муслим, 2308).
        </p>
        <p>
          8. Милостыня – это причина поддержания родственных связей. Пророк Мухаммад, да благословит его Аллах и
          приветствует, сказал: <br> «Милостыня, которая была дана обездоленному, является милостыней, а милостыня, которая
          была дана обездоленному родственнику, является милостыней и поддержанием родственных связей» (Привёл Ахмад и
          ат-Тирмизи).
        </p>
        <p>
          9. Милостыня защищает от всего дурного и гасит гнев Господа. Пророк Мухаммад, да благословит его Аллах и
          приветствует, сказал: <br> «Совершение добрых дел защищает от всего дурного. Милостыня, данная в тайне, тушит гнев
          Господа. Поддержание родственных связей является причиной увеличения срока жизни» (Хадис приведён в «ат-Таргыб
          ва ат-тархиб»).
        </p>
        <p>
          10. Милостыня – это исцеление жестокосердия. Один человек пожаловался Пророку Мухаммаду, да благословит его
          Аллах и приветствует, на своё жестокосердие, на что Посланник Аллаха, да благословит его Аллах и приветствует,
          сказал: <br>
        </p>
        <p>
          11. Милостыня – это причина твоего спасения от адского огня в Судный День. Всевышний Аллах сказал: <br> «Они дают
          пищу беднякам, сиротам и пленникам, несмотря на любовь к ней. Они говорят: «Мы кормим вас лишь ради Лика
          Аллаха и не хотим от вас ни награды, ни благодарности! Мы боимся от своего Господа того Мрачного и
          Томительного дня». Аллах защитит их от зла того дня и одарит их процветанием и радостью» (Коран, 76:8-11). А
          также Пророк Мухаммад, да благословит его Аллах и приветствует, сказал: «Остерегайтесь адского огня хотя бы
          половинкой финика (дав эту половинку нуждающемуся человеку)». (Привёл аль-Бухари, Муслим)
        </p>
        <p>
          12. Милостыня погашает ошибки и смывает грехи. Пророк Мухаммад, да благословит его Аллах и приветствует,
          сказал: <br> «Милостыня погашает ошибки, также как вода гасит огонь». (Привёл ат-Тирмизи)
        </p>
        <p>
          13. Милостыня – это причина для достижения любви Аллаха. Пророк Мухаммад, да благословит его Аллах и
          приветствует, сказал: <br> «Наиболее любимыми делами в отношении Аллаха, Могуч Он и Велик, являются: радость,
          которую ты приносишь мусульманину, или когда избавляешь его от печали, или избавляешь его от голода, или
          уплатишь за него долг». (Хадис приведён в «ат-Таргыб)
        </p>
        <p>
          14. Ангелы ежедневно делают дуа за человека, который раздаёт милостыню. Пророк Мухаммад, да благословит его
          Аллах и приветствует, сказал: <br> «Каждое утро, когда просыпаются рабы (Аллаха), спускаются два ангела и говорит
          один из них: «О, Аллах! Дай раздающему милостыню возмещение». И говорит другой: «О, Аллах! Дай
          воздерживающемуся от милостыни потерю». (Привёл аль-Бухари, Муслим).
        </p>
        <p>
          15. Награда за милостыню не прерывается даже после смерти. Пророк Мухаммад, да благословит его Аллах и
          приветствует, сказал: <br> «Когда умирает сын Адама (человек) все его дела прекращаются, кроме трёх вещей: текущая
          милостыня (милостыня с не прекращающейся пользой); знание, приносящее пользу; праведный ребёнок, делающий за
          него (своих родителей) дуа» (Привёл Муслим).
        </p>
        <p>
          16. Милостыня – это причина вхождения в рай. Пророк Мухаммад, да благословит его Аллах и приветствует, сказал: <br>
          «О, люди! Распространяйте приветствие (салям), кормите (нуждающихся), поддерживайте родственные связи,
          совершайте ночные молитвы в то время, когда все люди спят, и тогда войдёте в рай с миром»
        </p>
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
.tab {
  box-shadow: 0 0 48px 0 rgba(49, 79, 124, 0.12);
  background: #fff;
  border-radius: 36px;
  padding: 60px;

  font-weight: 300;
  font-size: 16px;

  max-width: 839px;
  width: 100%;


  @media (max-width: 1200px) {
    padding: 60px 40px;
  }

  @media (max-width: 430px) {
    max-width: unset;
    padding: 60px 20px;
  }

  p {
    font-family: "Sofia Pro", sans-serif;
    font-weight: 300;
    font-size: 16px;
    line-height: 150%;
    margin-bottom: 20px;

    &:last-child {
      margin-bottom: 0;
    }
  }

  &__item {
    margin-bottom: 40px;

    span {
      display: inline-block;
      font-weight: 600;
      margin-bottom: 20px;
    }

    ol {
      list-style: decimal;
      padding-left: 20px;
    }
  }


  &--alms {
    span {
      margin-bottom: 0;
    }
  }
}

</style>