<script setup lang="ts">
import InsaneTabComponment from "~/components/insane-zakat/InsaneTabComponment.vue";

const currentTab = ref('whatIsZakat');

const tabsValues = {
  whatIsZakat: 'Что такое закят?',
  payableFrom: 'С чего выплачивают закят?',
  recipients: 'Кто получает закят?',
  zakatUlitr: 'Закят уль-Фитр',
  alms: 'Милостыня (садака)'
}

const tabsInfo = [
  {
    title: 'whatIsZakat',
    content: '123123Фонд «Инсан» является лидером по сбору и распределению закята в России и в странах СНГ.\n' +
        '\n' +
        '                  Что такое закят? Закят (обязательная ежегодная выплата в пользу бедных) — это в первую очередь\n' +
        '                  поклонение Всевышнему.\n' +
        '\n' +
        '                  Слово «закят» означает — «очищение», «благодать», «рост», «увеличение» и «чистота».\n' +
        '\n' +
        '                  Закят связан с правами бедных и слабых на часть имущества богатых и состоятельных людей. Это выражение\n' +
        '                  милосердия, помощи и сочувствия, на которые нам указал Пророк Мухаммад (мир ему и благословение) в\n' +
        '                  известном хадисе: «Верующие, проявляющие дружеские чувства, милосердие и сочувствие друг к другу,\n' +
        '                  похожи на одно тело. Если одна его часть болит, то болит все тело» (Бухари).\n' +
        '\n' +
        '                  Закят — важный социально-экономический институт, призванный утвердить в обществе принципы\n' +
        '                  справедливости. Он сплачивает мусульман, призывает заботиться друг о друге, дает толчок к духовному\n' +
        '                  развитию и оздоровлению общества. Закят с имущества выплачивается\n' +
        '                  не чаще одного раза в год. Закят совершается по правилам, установленным Самим Всевышним.\n' +
        '\n' +
        '                  Закят в Фонде «Инсан» БФ «Инсан» помогает рассчитать закят и принимает его от мусульман для\n' +
        '                  дальнейшего распределения среди определенных категорий людей, указанных в Коране,\n' +
        '                  в соответствии с требованием шариата.\n' +
        '\n' +
        '                  Цель программы «Закят»\n' +
        '\n' +
        '                  Основная цель программы — донести материальную помощь до тех, кто в ней очень нуждается. Не всегда\n' +
        '                  выплачивающие закят знают о получателях, и тут фонд выступает посредником между плательщиками и\n' +
        '                  получающими закят, централизует и распределяет его среди незащищенных слоев населения, к которым\n' +
        '                  относятся: нищие, бедные, новообращенные, несостоятельные должники и путники. Под названные категории\n' +
        '                  могут подпадать и многодетные семьи, дети-сироты, одинокие старики и больные. «А тех, которые собирают\n' +
        '                  золото и серебро и не расходуют его на пути Аллаха, обрадуй мучительным наказанием. В тот День [их\n' +
        '                  золото и серебро] будет разожжено в огне геенны, и им будут заклеймены их лбы, и бока, и спины. Это\n' +
        '                  то, что вы сберегали для самих себя. Вкусите же то, что вы сберегали» (сура «Покаяние», аят 34).\n' +
        '\n' +
        '                  «Если человек, владеющий богатством, не выплачивает закят, то он будет гореть в пламени геенны и для\n' +
        '                  него будут уготовлены пластины, которыми будут прижигать его бока и лоб.\n' +
        '                  И продлится это, пока Аллах будет вершить суд над своими рабами в День, который равен пятидесяти\n' +
        '                  тысячам лет, а затем Аллах определит его место либо в Раю, либо в Аду» (сура «Покаяние», аят 35).\n' +
        '\n' +
        '                  Садака можно пожертвовать в любое время и в любом количестве. Садака — это сунна. Закят же, напротив,\n' +
        '                  — один из столпов Ислама, священная обязанность состоятельных мусульман. Пророк Мухаммад (мир ему и\n' +
        '                  благословение) говорил: «Поистине, богатство привлекательно\n' +
        '                  и приятно на вкус, и прекрасно поступит обладающий богатством мусульманин, если станет тратить часть\n' +
        '                  его на неимущих, сирот и путников» (Бухари).\n' +
        '\n' +
        '                  «Тому, чтобы были приняты их пожертвования, препятствует то, что они не веруют в Аллаха и Его\n' +
        '                  Посланника» (сура «Покаяние», аят 54). '
  },
  {
    title: 'payableFrom',
    content: 'Фонд «123123123123Инсан» является лидером по сбору и распределению закята в России и в странах СНГ.\n' +
        '\n' +
        '                  Что такое закят? Закят (обязательная ежегодная выплата в пользу бедных) — это в первую очередь\n' +
        '                  поклонение Всевышнему.\n' +
        '\n' +
        '                  Слово «закят» означает — «очищение», «благодать», «рост», «увеличение» и «чистота».\n' +
        '\n' +
        '                  Закят связан с правами бедных и слабых на часть имущества богатых и состоятельных людей. Это выражение\n' +
        '                  милосердия, помощи и сочувствия, на которые нам указал Пророк Мухаммад (мир ему и благословение) в\n' +
        '                  известном хадисе: «Верующие, проявляющие дружеские чувства, милосердие и сочувствие друг к другу,\n' +
        '                  похожи на одно тело. Если одна его часть болит, то болит все тело» (Бухари).\n' +
        '\n' +
        '                  Закят — важный социально-экономический институт, призванный утвердить в обществе принципы\n' +
        '                  справедливости. Он сплачивает мусульман, призывает заботиться друг о друге, дает толчок к духовному\n' +
        '                  развитию и оздоровлению общества. Закят с имущества выплачивается\n' +
        '                  не чаще одного раза в год. Закят совершается по правилам, установленным Самим Всевышним.\n' +
        '\n' +
        '                  Закят в Фонде «Инсан» БФ «Инсан» помогает рассчитать закят и принимает его от мусульман для\n' +
        '                  дальнейшего распределения среди определенных категорий людей, указанных в Коране,\n' +
        '                  в соответствии с требованием шариата.\n' +
        '\n' +
        '                  Цель программы «Закят»\n' +
        '\n' +
        '                  Основная цель программы — донести материальную помощь до тех, кто в ней очень нуждается. Не всегда\n' +
        '                  выплачивающие закят знают о получателях, и тут фонд выступает посредником между плательщиками и\n' +
        '                  получающими закят, централизует и распределяет его среди незащищенных слоев населения, к которым\n' +
        '                  относятся: нищие, бедные, новообращенные, несостоятельные должники и путники. Под названные категории\n' +
        '                  могут подпадать и многодетные семьи, дети-сироты, одинокие старики и больные. «А тех, которые собирают\n' +
        '                  золото и серебро и не расходуют его на пути Аллаха, обрадуй мучительным наказанием. В тот День [их\n' +
        '                  золото и серебро] будет разожжено в огне геенны, и им будут заклеймены их лбы, и бока, и спины. Это\n' +
        '                  то, что вы сберегали для самих себя. Вкусите же то, что вы сберегали» (сура «Покаяние», аят 34).\n' +
        '\n' +
        '                  «Если человек, владеющий богатством, не выплачивает закят, то он будет гореть в пламени геенны и для\n' +
        '                  него будут уготовлены пластины, которыми будут прижигать его бока и лоб.\n' +
        '                  И продлится это, пока Аллах будет вершить суд над своими рабами в День, который равен пятидесяти\n' +
        '                  тысячам лет, а затем Аллах определит его место либо в Раю, либо в Аду» (сура «Покаяние», аят 35).\n' +
        '\n' +
        '                  Садака можно пожертвовать в любое время и в любом количестве. Садака — это сунна. Закят же, напротив,\n' +
        '                  — один из столпов Ислама, священная обязанность состоятельных мусульман. Пророк Мухаммад (мир ему и\n' +
        '                  благословение) говорил: «Поистине, богатство привлекательно\n' +
        '                  и приятно на вкус, и прекрасно поступит обладающий богатством мусульманин, если станет тратить часть\n' +
        '                  его на неимущих, сирот и путников» (Бухари).\n' +
        '\n' +
        '                  «Тому, чтобы были приняты их пожертвования, препятствует то, что они не веруют в Аллаха и Его\n' +
        '                  Посланника» (сура «Покаяние», аят 54). '
  },
  {
    title: 'recipients',
    content: 'Ф214124124124онд «Инсан» является лидером по сбору и распределению закята в России и в странах СНГ.\n' +
        '\n' +
        '                  Что такое закят? Закят (обязательная ежегодная выплата в пользу бедных) — это в первую очередь\n' +
        '                  поклонение Всевышнему.\n' +
        '\n' +
        '                  Слово «закят» означает — «очищение», «благодать», «рост», «увеличение» и «чистота».\n' +
        '\n' +
        '                  Закят связан с правами бедных и слабых на часть имущества богатых и состоятельных людей. Это выражение\n' +
        '                  милосердия, помощи и сочувствия, на которые нам указал Пророк Мухаммад (мир ему и благословение) в\n' +
        '                  известном хадисе: «Верующие, проявляющие дружеские чувства, милосердие и сочувствие друг к другу,\n' +
        '                  похожи на одно тело. Если одна его часть болит, то болит все тело» (Бухари).\n' +
        '\n' +
        '                  Закят — важный социально-экономический институт, призванный утвердить в обществе принципы\n' +
        '                  справедливости. Он сплачивает мусульман, призывает заботиться друг о друге, дает толчок к духовному\n' +
        '                  развитию и оздоровлению общества. Закят с имущества выплачивается\n' +
        '                  не чаще одного раза в год. Закят совершается по правилам, установленным Самим Всевышним.\n' +
        '\n' +
        '                  Закят в Фонде «Инсан» БФ «Инсан» помогает рассчитать закят и принимает его от мусульман для\n' +
        '                  дальнейшего распределения среди определенных категорий людей, указанных в Коране,\n' +
        '                  в соответствии с требованием шариата.\n' +
        '\n' +
        '                  Цель программы «Закят»\n' +
        '\n' +
        '                  Основная цель программы — донести материальную помощь до тех, кто в ней очень нуждается. Не всегда\n' +
        '                  выплачивающие закят знают о получателях, и тут фонд выступает посредником между плательщиками и\n' +
        '                  получающими закят, централизует и распределяет его среди незащищенных слоев населения, к которым\n' +
        '                  относятся: нищие, бедные, новообращенные, несостоятельные должники и путники. Под названные категории\n' +
        '                  могут подпадать и многодетные семьи, дети-сироты, одинокие старики и больные. «А тех, которые собирают\n' +
        '                  золото и серебро и не расходуют его на пути Аллаха, обрадуй мучительным наказанием. В тот День [их\n' +
        '                  золото и серебро] будет разожжено в огне геенны, и им будут заклеймены их лбы, и бока, и спины. Это\n' +
        '                  то, что вы сберегали для самих себя. Вкусите же то, что вы сберегали» (сура «Покаяние», аят 34).\n' +
        '\n' +
        '                  «Если человек, владеющий богатством, не выплачивает закят, то он будет гореть в пламени геенны и для\n' +
        '                  него будут уготовлены пластины, которыми будут прижигать его бока и лоб.\n' +
        '                  И продлится это, пока Аллах будет вершить суд над своими рабами в День, который равен пятидесяти\n' +
        '                  тысячам лет, а затем Аллах определит его место либо в Раю, либо в Аду» (сура «Покаяние», аят 35).\n' +
        '\n' +
        '                  Садака можно пожертвовать в любое время и в любом количестве. Садака — это сунна. Закят же, напротив,\n' +
        '                  — один из столпов Ислама, священная обязанность состоятельных мусульман. Пророк Мухаммад (мир ему и\n' +
        '                  благословение) говорил: «Поистине, богатство привлекательно\n' +
        '                  и приятно на вкус, и прекрасно поступит обладающий богатством мусульманин, если станет тратить часть\n' +
        '                  его на неимущих, сирот и путников» (Бухари).\n' +
        '\n' +
        '                  «Тому, чтобы были приняты их пожертвования, препятствует то, что они не веруют в Аллаха и Его\n' +
        '                  Посланника» (сура «Покаяние», аят 54). '
  },
  {
    title: 'zakatUlitr',
    content: 'Фонд «Инсан» является лидером по сбору и распределению закята в России и в странах СНГ.\n' +
        '\n' +
        '                  Что такое закят? Закят (обязательная ежегодная выплата в пользу бедных) — это в первую очередь\n' +
        '                  поклонение Всевышнему.\n' +
        '\n' +
        '                  Слово «закят» означает — «очищение», «благодать», «рост», «увеличение» и «чистота».\n' +
        '\n' +
        '                  Закят связан с правами бедных и слабых на часть имущества богатых и состоятельных людей. Это выражение\n' +
        '                  милосердия, помощи и сочувствия, на которые нам указал Пророк Мухаммад (мир ему и благословение) в\n' +
        '                  известном хадисе: «Верующие, проявляющие дружеские чувства, милосердие и сочувствие друг к другу,\n' +
        '                  похожи на одно тело. Если одна его часть болит, то болит все тело» (Бухари).\n' +
        '\n' +
        '                  Закят — важный социально-экономический институт, призванный утвердить в обществе принципы\n' +
        '                  справедливости. Он сплачивает мусульман, призывает заботиться друг о друге, дает толчок к духовному\n' +
        '                  развитию и оздоровлению общества. Закят с имущества выплачивается\n' +
        '                  не чаще одного раза в год. Закят совершается по правилам, установленным Самим Всевышним.\n' +
        '\n' +
        '                  Закят в Фонде «Инсан» БФ «Инсан» помогает рассчитать закят и принимает его от мусульман для\n' +
        '                  дальнейшего распределения среди определенных категорий людей, указанных в Коране,\n' +
        '                  в соответствии с требованием шариата.\n' +
        '\n' +
        '                  Цель программы «Закят»\n' +
        '\n' +
        '                  Основная цель программы — донести материальную помощь до тех, кто в ней очень нуждается. Не всегда\n' +
        '                  выплачивающие закят знают о получателях, и тут фонд выступает посредником между плательщиками и\n' +
        '                  получающими закят, централизует и распределяет его среди незащищенных слоев населения, к которым\n' +
        '                  относятся: нищие, бедные, новообращенные, несостоятельные должники и путники. Под названные категории\n' +
        '                  могут подпадать и многодетные семьи, дети-сироты, одинокие старики и больные. «А тех, которые собирают\n' +
        '                  золото и серебро и не расходуют его на пути Аллаха, обрадуй мучительным наказанием. В тот День [их\n' +
        '                  золото и серебро] будет разожжено в огне геенны, и им будут заклеймены их лбы, и бока, и спины. Это\n' +
        '                  то, что вы сберегали для самих себя. Вкусите же то, что вы сберегали» (сура «Покаяние», аят 34).\n' +
        '\n' +
        '                  «Если человек, владеющий богатством, не выплачивает закят, то он будет гореть в пламени геенны и для\n' +
        '                  него будут уготовлены пластины, которыми будут прижигать его бока и лоб.\n' +
        '                  И продлится это, пока Аллах будет вершить суд над своими рабами в День, который равен пятидесяти\n' +
        '                  тысячам лет, а затем Аллах определит его место либо в Раю, либо в Аду» (сура «Покаяние», аят 35).\n' +
        '\n' +
        '                  Садака можно пожертвовать в любое время и в любом количестве. Садака — это сунна. Закят же, напротив,\n' +
        '                  — один из столпов Ислама, священная обязанность состоятельных мусульман. Пророк Мухаммад (мир ему и\n' +
        '                  благословение) говорил: «Поистине, богатство привлекательно\n' +
        '                  и приятно на вкус, и прекрасно поступит обладающий богатством мусульманин, если станет тратить часть\n' +
        '                  его на неимущих, сирот и путников» (Бухари).\n' +
        '\n' +
        '                  «Тому, чтобы были приняты их пожертвования, препятствует то, что они не веруют в Аллаха и Его\n' +
        '                  Посланника» (сура «Покаяние», аят 54). '
  },
  {
    title: 'alms',
    content: 'Фонд «Инсан» является лидером по сбору и распределению закята в России и в странах СНГ.\n' +
        '\n' +
        '                  Что такое закят? Закят (обязательная ежегодная выплата в пользу бедных) — это в первую очередь\n' +
        '                  поклонение Всевышнему.\n' +
        '\n' +
        '                  Слово «закят» означает — «очищение», «благодать», «рост», «увеличение» и «чистота».\n' +
        '\n' +
        '                  Закят связан с правами бедных и слабых на часть имущества богатых и состоятельных людей. Это выражение\n' +
        '                  милосердия, помощи и сочувствия, на которые нам указал Пророк Мухаммад (мир ему и благословение) в\n' +
        '                  известном хадисе: «Верующие, проявляющие дружеские чувства, милосердие и сочувствие друг к другу,\n' +
        '                  похожи на одно тело. Если одна его часть болит, то болит все тело» (Бухари).\n' +
        '\n' +
        '                  Закят — важный социально-экономический институт, призванный утвердить в обществе принципы\n' +
        '                  справедливости. Он сплачивает мусульман, призывает заботиться друг о друге, дает толчок к духовному\n' +
        '                  развитию и оздоровлению общества. Закят с имущества выплачивается\n' +
        '                  не чаще одного раза в год. Закят совершается по правилам, установленным Самим Всевышним.\n' +
        '\n' +
        '                  Закят в Фонде «Инсан» БФ «Инсан» помогает рассчитать закят и принимает его от мусульман для\n' +
        '                  дальнейшего распределения среди определенных категорий людей, указанных в Коране,\n' +
        '                  в соответствии с требованием шариата.\n' +
        '\n' +
        '                  Цель программы «Закят»\n' +
        '\n' +
        '                  Основная цель программы — донести материальную помощь до тех, кто в ней очень нуждается. Не всегда\n' +
        '                  выплачивающие закят знают о получателях, и тут фонд выступает посредником между плательщиками и\n' +
        '                  получающими закят, централизует и распределяет его среди незащищенных слоев населения, к которым\n' +
        '                  относятся: нищие, бедные, новообращенные, несостоятельные должники и путники. Под названные категории\n' +
        '                  могут подпадать и многодетные семьи, дети-сироты, одинокие старики и больные. «А тех, которые собирают\n' +
        '                  золото и серебро и не расходуют его на пути Аллаха, обрадуй мучительным наказанием. В тот День [их\n' +
        '                  золото и серебро] будет разожжено в огне геенны, и им будут заклеймены их лбы, и бока, и спины. Это\n' +
        '                  то, что вы сберегали для самих себя. Вкусите же то, что вы сберегали» (сура «Покаяние», аят 34).\n' +
        '\n' +
        '                  «Если человек, владеющий богатством, не выплачивает закят, то он будет гореть в пламени геенны и для\n' +
        '                  него будут уготовлены пластины, которыми будут прижигать его бока и лоб.\n' +
        '                  И продлится это, пока Аллах будет вершить суд над своими рабами в День, который равен пятидесяти\n' +
        '                  тысячам лет, а затем Аллах определит его место либо в Раю, либо в Аду» (сура «Покаяние», аят 35).\n' +
        '\n' +
        '                  Садака можно пожертвовать в любое время и в любом количестве. Садака — это сунна. Закят же, напротив,\n' +
        '                  — один из столпов Ислама, священная обязанность состоятельных мусульман. Пророк Мухаммад (мир ему и\n' +
        '                  благословение) говорил: «Поистине, богатство привлекательно\n' +
        '                  и приятно на вкус, и прекрасно поступит обладающий богатством мусульманин, если станет тратить часть\n' +
        '                  его на неимущих, сирот и путников» (Бухари).\n' +
        '\n' +
        '                  «Тому, чтобы были приняты их пожертвования, препятствует то, что они не веруют в Аллаха и Его\n' +
        '                  Посланника» (сура «Покаяние», аят 54). '
  }
]

definePageMeta({
  title: 'Закят',
  breadcrumb: {
    ariaLabel: 'Закят'
  }
})
</script>

<template>
  <NuxtLayout>
    <section class="section zakat">
      <div class="container">
        <div class="zakat__heading">
          <h1 class="title-h1">Закят</h1>
        </div>

        <div class="zakat-tabs">
          <button @click="currentTab = 'whatIsZakat'" class="zakat-button"
                  :class="{'zakat-button--active': currentTab === 'whatIsZakat'}">Что такое
            закят?
          </button>
          <button @click="currentTab = 'payableFrom'" class="zakat-button"
                  :class="{'zakat-button--active': currentTab === 'payableFrom'}">С чего
            выплачивают
            закят?
          </button>
          <button @click="currentTab = 'recipients'" class="zakat-button"
                  :class="{'zakat-button--active': currentTab === 'recipients'}">Кто получает
            закят?
          </button>
          <button @click="currentTab = 'zakatUlitr'" class="zakat-button"
                  :class="{'zakat-button--active': currentTab === 'zakatUlitr'}">Закят уль-Фитр
          </button>
          <button @click="currentTab = 'alms'" class="zakat-button"
                  :class="{'zakat-button--active': currentTab === 'alms'}">Милостыня (садака)
          </button>
        </div>

        <div class="zakat__content">

          <div class="tabs-content">
            <InsaneTabComponment v-for="(tabData, index) in tabsInfo" :key="index" :tab-data="tabData" :current-tab="currentTab"/>
          </div>

          <InsaneZakatForm/>
        </div>

      </div>
    </section>
  </NuxtLayout>
</template>

<style scoped lang="scss">
.container {
  display: block;
  justify-content: unset;
}

.zakat {
  margin-bottom: 100px;

  &__heading {
    margin-bottom: 60px;
  }
  
  &__content {
    display: flex;
    gap: 20px;
    
    @media (max-width: 768px) {
      flex-direction: column;
    }
  }
}

.zakat-tabs {
  display: flex;
  flex-wrap: wrap;
  gap: 10px;
  margin-bottom: 20px;
}

.zakat-button {
  font-size: 14px;
  border-radius: 60px;
  letter-spacing: -0.01em;
  background-color: #FFFFFF;
  padding: 16px;

  transition: box-shadow .2s linear;

  &--active {
    box-shadow: 0 0 48px 0 rgba(49, 79, 124, 0.12);
  }
}

</style>