export default `
<p>
Мы стараемся найти помощь и взрослым и детям, готовы выслушать и вникнуть в Вашу ситуацию, потому что понимаем — несчастен каждый по-своему.
</p>
<p>
Невозможно описать формальным правилом людей, которые попали в тяжелое положение и находятся в горе. Единственное необходимое требование: обязательно подробнее рассказывайте о своей проблеме, прикладывайте максимально возможное количество документов и будьте готовы пообщаться с корреспондентом нашего фонда.
</p>
<p>
Поэтому оставьте свой телефон и адрес электронной почты. Вся введенная Вами информация считается конфиденциальной и не передается третьим лицам.
</p>
`