export default {
  title: 'Ключевые направления фонда:',
  description: 'Наша миссия — организация постоянной помощи нуждающимся, больным детям и детям, оставшимся без попечения родителей, старикам, вдовам \n' +
    'и матерям-одиночкам.',
  mainDirections: [
    {
      title: 'Cбор средств на лечение\n и реабилитацию тяжелобольных\n детей и взрослых;',
      icon: {
        width: 98,
        height: 79,
        alt: 'звезда',
        src: '/img/png/Star.png'
      }
    },
    {
      title: 'Финансовая, материальная \nи медицинская помощь одиноким старикам,\n сиротам, многодетным семьям и т.д',
      icon: {
        width: 73,
        height: 81,
        alt: 'платежи',
        src: '/img/png/wallet.png'
      }
    },
  ]
}